In [2]:
import numpy as np
import pandas as pd

In [3]:
a = pd.Series([1,3,7,9,15], index=['Atom', 'Beton', 'Skvara', 'Akvarel', 'MEzonet'])
print(a)

Atom        1
Beton       3
Skvara      7
Akvarel     9
MEzonet    15
dtype: int64

In [4]:
data = {'Kraj':['Bratislavsky', 'Trnavsky', 'Kosicky'],
       'Mesto':['Pezinok', 'Trnava', 'Kosice'],
       'Hodnoty':[54,32,87]}

df = pd.DataFrame(data, columns=['Kraj', 'Mesto', 'Hodnoty'])
print(df)

           Kraj    Mesto  Hodnoty
0  Bratislavsky  Pezinok       54
1      Trnavsky   Trnava       32
2       Kosicky   Kosice       87

In [5]:
df.drop('Mesto', axis=1)

           Kraj  Hodnoty
0  Bratislavsky       54
1      Trnavsky       32
2       Kosicky       87

In [6]:
df.sort_index()
df.sort_values(by='Hodnoty')

           Kraj    Mesto  Hodnoty
1      Trnavsky   Trnava       32
0  Bratislavsky  Pezinok       54
2       Kosicky   Kosice       87

In [7]:
df.rank()

   Kraj  Mesto  Hodnoty
0   1.0    2.0      2.0
1   3.0    3.0      1.0
2   2.0    1.0      3.0

In [8]:
df['Rank'] = df['Hodnoty'].rank()
print(df)

           Kraj    Mesto  Hodnoty  Rank
0  Bratislavsky  Pezinok       54   2.0
1      Trnavsky   Trnava       32   1.0
2       Kosicky   Kosice       87   3.0

In [9]:
df.to_csv('nase_data.csv')
df2 = pd.read_csv('nase_data.csv')
print(df2)

   Unnamed: 0          Kraj    Mesto  Hodnoty  Rank
0           0  Bratislavsky  Pezinok       54   2.0
1           1      Trnavsky   Trnava       32   1.0
2           2       Kosicky   Kosice       87   3.0

In [10]:
df2.to_excel('data.xlsx', sheet_name='Namerane_hodnoty')
xlsx = pd.ExcelFile('data.xlsx')
print(xlsx)
df = pd.read_excel(xlsx, 'Namerane_hodnoty')
print(df['Kraj'])

<pandas.io.excel._base.ExcelFile object at 0x00000204533EA4D0>
0    Bratislavsky
1        Trnavsky
2         Kosicky
Name: Kraj, dtype: object

In [11]:
f = pd.read_csv('nase_data.csv')
print(f)

   Unnamed: 0          Kraj    Mesto  Hodnoty  Rank
0           0  Bratislavsky  Pezinok       54   2.0
1           1      Trnavsky   Trnava       32   1.0
2           2       Kosicky   Kosice       87   3.0

In [12]:
print(f[0:1])  # neda sa po jednom cisle

   Unnamed: 0          Kraj    Mesto  Hodnoty  Rank
0           0  Bratislavsky  Pezinok       54   2.0

In [13]:
print(f[0:])

   Unnamed: 0          Kraj    Mesto  Hodnoty  Rank
0           0  Bratislavsky  Pezinok       54   2.0
1           1      Trnavsky   Trnava       32   1.0
2           2       Kosicky   Kosice       87   3.0

In [14]:
f.iloc[[2],[2]]

    Mesto
2  Kosice

In [15]:
f.loc[[2],['Kraj']]

      Kraj
2  Kosicky

In [16]:
f.loc[[0], ['Kraj']] = 'Zilinsky'
print(f)

   Unnamed: 0      Kraj    Mesto  Hodnoty  Rank
0           0  Zilinsky  Pezinok       54   2.0
1           1  Trnavsky   Trnava       32   1.0
2           2   Kosicky   Kosice       87   3.0

In [17]:
f.shape

(3, 5)

In [18]:
f.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
f.columns

Index(['Unnamed: 0', 'Kraj', 'Mesto', 'Hodnoty', 'Rank'], dtype='object')

In [20]:
f.info

<bound method DataFrame.info of    Unnamed: 0      Kraj    Mesto  Hodnoty  Rank
0           0  Zilinsky  Pezinok       54   2.0
1           1  Trnavsky   Trnava       32   1.0
2           2   Kosicky   Kosice       87   3.0>

In [21]:
f.count

<bound method DataFrame.count of    Unnamed: 0      Kraj    Mesto  Hodnoty  Rank
0           0  Zilinsky  Pezinok       54   2.0
1           1  Trnavsky   Trnava       32   1.0
2           2   Kosicky   Kosice       87   3.0>